app/Controllers/BukuController.php

SELECT *
FROM `buku`
---
    public function index()
    {
        return view('buku/index', [
            'buku' => (new BukuModel())->findAll()
        ]);

SELECT *
FROM `buku`
WHERE `buku`.`id` = '1'
---
    public function edit($id)
    {
        return view('buku/edit', [
            'buku' => (new BukuModel())->find($id)
        ]);